<img src="StandardDataQualityDimensions.png" alt="StandardDataQualityDimensions.png" style="width: 300px; float: left;"/>

In [1]:
import pandas as pd
import numpy as np
from datetime import time, datetime

# Transactions

**Accuracy**	
* product_first_sold_date

**Completeness**	
* online_order
* brand
* product_line
* product_class
* product_size
* standard_cost
* product_first_sold_date

**Consistency**	
* list_price (no dollar symbol)
* standard_cost (dollar symbol)
* cust_id  has values that does not exist in Customer:cust_id

**Currency**	

**Relevancy**	
* standard_cost (purpose of this monetary value)
* list_price (purpose of this monetary value)

**Validity**	
* product_first_sold_date (float value, no date values)

**Duplicates**

In [2]:
# Importing datafile into dataframe
df_trans = pd.read_csv('Transactions.csv', parse_dates=['transaction_date'])

In [3]:
# Displaying dataframe summary
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  object
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  object
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(7)
memory usage: 1.4+ MB

In [4]:
df_trans.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,$53.62,41245.0
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,41701.0
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,$248.82,36361.0
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,$381.10,36145.0
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,$709.48,42226.0

In [5]:
df_trans['transaction_date'].max(), df_trans['transaction_date'].min()

(Timestamp('2017-12-30 00:00:00'), Timestamp('2017-01-01 00:00:00'))

In [6]:
# Convert standard_cost to float datatype

# Remove dollar sign from string
df_trans['standard_cost'] = df_trans['standard_cost'].str.replace('$','')

# Remove comma from string
df_trans['standard_cost'] = df_trans['standard_cost'].str.replace(',','')

# Making the conversion after the extra characters were removed
df_trans['standard_cost'] = df_trans['standard_cost'].astype(float)

In [7]:
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  object
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(6)
memory usage: 1.5+ MB

In [8]:
# Determine if trans_ids are in sequential order
trans_ids = df_trans['transaction_id'].to_list()
compare_trans_ids = range(1, df_trans.shape[0]+1, 1)

trans_ids == list(compare_trans_ids)

True

In [9]:
# Checking for all possible order_status values
df_trans['order_status'].unique()

array(['Approved', 'Cancelled'], dtype=object)

In [10]:
# Checking for all possible product_class values
df_trans['product_class'].unique()

array(['medium', 'low', 'high', nan], dtype=object)

In [11]:
# Checking for all possible online_order values
df_trans['online_order'].unique()

array([False, True, nan], dtype=object)

In [12]:
# Checking for all possible product_size values
df_trans['product_size'].unique()

array(['medium', 'large', 'small', nan], dtype=object)

In [13]:
# Determine the range for list_price
df_trans['list_price'].min(), df_trans['list_price'].max()

(12.01, 2091.47)

In [14]:
# Determine the range for standard_cost
df_trans['standard_cost'].min(), df_trans['standard_cost'].max()

(7.21, 1759.85)

In [15]:
# Checking for all possible product_size values
df_trans['product_line'].unique()

array(['Standard', 'Road', 'Mountain', 'Touring', nan], dtype=object)

In [16]:
# Checking for all possible brand values
df_trans['brand'].unique()

array(['Solex', 'Trek Bicycles', 'OHM Cycles', 'Norco Bicycles',
       'Giant Bicycles', 'WeareA2B', nan], dtype=object)

In [17]:
# Checking for duplicate rows

df_trans[df_trans.duplicated()]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

In [18]:
# Checking for duplicated transaction_ids

df_trans[df_trans['transaction_id'].duplicated()]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

# CustomerAddress


**Accuracy**	
* address

**Completeness**	

**Consistency**	
* state (some values are abbreviated)

**Currency**	

**Relevancy**	
* property_valuation

**Validity**	

**Duplicates**

In [19]:
# Importing datafile into dataframe

df_cust_addr = pd.read_csv('CustomerAddress.csv')

In [20]:
# Displaying dataframe summary

df_cust_addr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 140.7+ KB

In [21]:
df_cust_addr.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [22]:
# Verify if data is for one country

df_cust_addr['country'].unique()

array(['Australia'], dtype=object)

In [23]:
# Determine if customer_ids are in sequential order
customer_ids = df_cust_addr['customer_id'].to_list()
compare_cust_ids = range(1, df_cust_addr.shape[0]+1, 1)

trans_ids == list(compare_cust_ids)

False

In [24]:
df_cust_addr['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [25]:
# Look for duplicate values

df_cust_addr[df_cust_addr.duplicated()]

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

In [26]:
# Checking for duplicate customer_id values

df_cust_addr[df_cust_addr['customer_id'].duplicated()]

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

# Customer Demographic


**Accuracy**	
* default                              

**Completeness**	
* last_name
* DOB
* job_title
* job_industry_category
* default
* tenure

**Consistency**	
* gender
* deceased_indicator (uses N/Y)
* owns_car (uses No / Yes)

**Currency**	

**Relevancy**	
* default
* tenure

**Validity**	

**Duplicates**

In [27]:
# Data file did not contain columns, so creating temporary columns for dataframe
#columns = ['col' + str(x) for x in range(13)]

# Importing datafile into dataframe
df_cust_demo = pd.read_csv('CustomerDemographic.csv')

In [28]:
# Displaying dataframe summary

df_cust_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 250.1+ KB

In [29]:
# Checking for all possible values for Make and Female

df_cust_demo['gender'].unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [34]:
# Checking for any unreasonable values

df_cust_demo['past_3_years_bike_related_purchases'].unique()

array([93, 81, 61, 33, 56, 35,  6, 31, 97, 49, 99, 58, 38, 85, 91, 57, 79,
       76, 72, 74, 43, 55, 12, 37,  5, 62, 18,  3, 17, 44, 59, 40, 46, 64,
       24, 63, 98, 51, 68, 22,  2, 48, 87, 26, 60, 47, 73, 21, 67, 16, 78,
       30, 94, 28, 20, 11,  1, 75, 41, 69, 19, 80, 83, 25, 54,  4, 23, 65,
       88, 10, 77,  9, 82, 27, 53, 32, 34, 71, 36, 90, 95,  8, 39,  7, 42,
       13, 45, 50, 14, 89, 84, 96, 70, 66,  0, 15, 86, 92, 29, 52],
      dtype=int64)

In [35]:
# Chcking for any unreasonable values

df_cust_demo['job_title'].unique()

array(['Executive Secretary', 'Administrative Officer',
       'Recruiting Manager', nan, 'Senior Editor', 'Media Manager I',
       'Business Systems Development Analyst', 'Senior Quality Engineer',
       'Nuclear Power Engineer', 'Developer I', 'Account Executive',
       'Junior Executive', 'Media Manager IV', 'Sales Associate',
       'Professor', 'Geological Engineer', 'Project Manager',
       'Safety Technician I', 'Research Assistant I',
       'Accounting Assistant III', 'Editor', 'Research Nurse',
       'Safety Technician III', 'Staff Accountant III', 'Legal Assistant',
       'Product Engineer', 'Information Systems Manager',
       'VP Quality Control', 'Social Worker', 'Senior Cost Accountant',
       'Assistant Media Planner', 'Payment Adjustment Coordinator',
       'Food Chemist', 'Accountant III', 'Director of Sales',
       'Senior Financial Analyst', 'Registered Nurse',
       'Biostatistician II', 'Computer Systems Analyst II',
       'Software Test Engineer II', 'Paralegal', 'VP Sales',
       'Chief Design Engineer', 'Office Assistant III',
       'Physical Therapy Assistant', 'Help Desk Operator',
       'Web Developer II', 'Research Associate', 'Teacher',
       'VP Product Management', 'Statistician II',
       'Automation Specialist IV', 'Data Coordiator',
       'Software Test Engineer III', 'Internal Auditor',
       'Analyst Programmer', 'Occupational Therapist',
       'Speech Pathologist', 'Quality Control Specialist',
       'Civil Engineer', 'Software Engineer III',
       'Community Outreach Specialist', 'Safety Technician IV',
       'VP Accounting', 'General Manager', 'Nurse Practicioner',
       'Automation Specialist II', 'Marketing Assistant',
       'Marketing Manager', 'Staff Scientist', 'Assistant Professor',
       'Budget/Accounting Analyst IV', 'Associate Professor',
       'Graphic Designer', 'Administrative Assistant II',
       'Compensation Analyst', 'Systems Administrator III',
       'Financial Advisor', 'Chemical Engineer', 'Web Designer I',
       'Senior Developer', 'Office Assistant II', 'Recruiter', 'Operator',
       'Programmer Analyst III', 'Quality Engineer', 'Environmental Tech',
       'Analog Circuit Design manager', 'Cost Accountant', 'Librarian',
       'Structural Analysis Engineer', 'Pharmacist', 'Assistant Manager',
       'Accountant I', 'Web Designer III', 'Geologist III',
       'Software Test Engineer I', 'Structural Engineer',
       'Safety Technician II', 'Web Developer III',
       'Programmer Analyst II', 'Design Engineer', 'Statistician I',
       'VP Marketing', 'Desktop Support Technician', 'Actuary',
       'Database Administrator III', 'Electrical Engineer',
       'Tax Accountant', 'Clinical Specialist',
       'Database Administrator IV', 'Systems Administrator II',
       'Account Coordinator', 'Programmer III',
       'Administrative Assistant III', 'Nurse', 'Technical Writer',
       'Staff Accountant II', 'Dental Hygienist', 'Sales Representative',
       'Budget/Accounting Analyst III', 'Computer Systems Analyst IV',
       'Geologist I', 'Financial Analyst', 'Accounting Assistant II',
       'Senior Sales Associate', 'Database Administrator II',
       'Engineer I', 'Budget/Accounting Analyst I', 'Developer IV',
       'Database Administrator I', 'Environmental Specialist',
       'Computer Systems Analyst I', 'Account Representative IV',
       'Statistician IV', 'Human Resources Manager',
       'GIS Technical Architect', 'Programmer IV',
       'Accounting Assistant IV', 'Software Engineer IV', 'Programmer II',
       'Engineer III', 'Software Consultant', 'Biostatistician IV',
       'Help Desk Technician', 'Automation Specialist I', 'Developer III',
       'Human Resources Assistant I', 'Geologist IV', 'Media Manager II',
       'Statistician III', 'Engineer II', 'Health Coach II',
       'Developer II', 'Systems Administrator I', 'Web Developer I',
       'Software Engineer II', 'Accounting Assistant I',
       'Research Assistant II', 'Programmer Analyst IV', 'Health Coach I',
       'Accountant II', 'Automation Specialist III',
       'Administrative Assistant I', 'Health Coach IV',
       'Media Manager III', 'Account Representative III',
       'Web Designer IV', 'Budget/Accounting Analyst II',
       'Web Developer IV', 'Programmer I', 'Biostatistician III',
       'Software Test Engineer IV', 'Research Assistant IV',
       'Account Representative I', 'Accountant IV', 'Biostatistician I',
       'Human Resources Assistant IV', 'Administrative Assistant IV',
       'Office Assistant I', 'Human Resources Assistant II',
       'Mechanical Systems Engineer', 'Engineer IV', 'Health Coach III',
       'Office Assistant IV', 'Software Engineer I',
       'Human Resources Assistant III', 'Staff Accountant I',
       'Computer Systems Analyst III', 'Geologist II', 'Web Designer II',
       'Staff Accountant IV', 'Account Representative II',
       'Programmer Analyst I', 'Systems Administrator IV',
       'Research Assistant III'], dtype=object)

In [36]:
# Checking for all possible values

df_cust_demo['deceased_indicator'].unique()

array(['N', 'Y'], dtype=object)

In [37]:
# Checking for all possible values

df_cust_demo['owns_car'].unique()

array(['Yes', 'No'], dtype=object)

In [38]:
# Checking for all possible values

df_cust_demo['tenure'].value_counts()

7.0     235
5.0     228
11.0    221
10.0    218
16.0    215
8.0     211
18.0    208
12.0    202
9.0     200
14.0    200
6.0     192
13.0    191
4.0     191
17.0    182
15.0    179
1.0     166
3.0     160
19.0    159
2.0     150
20.0     96
22.0     55
21.0     54
Name: tenure, dtype: int64

In [39]:
df_cust_demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,10/12/1953,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,12/16/1980,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1/20/1954,Recruiting Manager,Property,Mass Customer,N,1-Feb,Yes,15.0
3,4,Talbot,NaN,Male,33,10/3/1961,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,5/13/1977,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [40]:
df_cust_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 250.1+ KB

In [42]:
# Checking for duplicated customer_ids

df_cust_demo[df_cust_demo['customer_id'].duplicated()]

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, default, owns_car, tenure]
Index: []

In [ ]:
# Created custom function because the date columns has multiple date formats. The year has been extracted to determine the age 
# of the customers.  Only one customer has an age of 177 years old, so that would be an outlier and have to be discarded or 
# verified with the company providing the data.

def convertYear(dob):
    currentYear = datetime.now().year
    
    if isinstance(dob, str):
        birthYear = dob.split('/')
        
        if len(birthYear) == 1:
            birthYear = dob.split('-')
            return currentYear - int(birthYear[0])
        else:
            return currentYear - int(birthYear[2])
    else:
        return dob

# Set the age based on the DOB provided
df_cust_demo['age'] = df_cust_demo['DOB'].apply(lambda x : convertYear(x))

In [ ]:
df_cust_demo.head()

In [ ]:
# Query for max and min DOB. 
# The high value is unreasonable, so add this to the valid column of the Data Quality Framework table

df_cust_demo['age'].max(), df_cust_demo['age'].min()

In [ ]:
# Checking for min and max alues in the age column

df_cust_demo.query('age > 100')

In [ ]:
# Checking for duplicated rows

df_cust_demo[df_cust_demo.duplicated()]

In [ ]:
# Checking for duplicated customer_ids

df_cust_demo[df_cust_demo['customer_id'].duplicated()]

# NewCustomerList

**Accuracy**	

**Completeness**	
* last_name
* DOB
* job_title
* job_industry_category

**Consistency**	

**Currency**	

**Relevancy**	
* job_title
* job_industry_category
* wealth_segment                       
* deceased_indicator
* tenure
* property_valuation
* Rank (with respect to what)
* Value (Is this home value?) 

**Validity**	

**Duplicates**

In [46]:
# Importing datafile into dataframe
df_new_cust_list = pd.read_csv('NewCustomerList.csv')

In [47]:
# In original Excel datafile, there are five hidden columns (17, 18, 19, 20, 21)
# Are these values important?

df_new_cust_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    object
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Rank                                 1000 non-null   int64
 17  Value                                1000 non-null   float64
dtypes: float64(1), int64(5), object(12)
memory usage: 93.8+ KB

In [ ]:
df_new_cust_list.head()

In [ ]:
# Determine age based on year. 

current_year = datetime.now().year
df_new_cust_list['age'] = df_new_cust_list['DOB'].apply(lambda x : x if pd.isnull(x) else current_year - int(x[-4:]))
df_new_cust_list['age'] = df_new_cust_list['age'].astype('Int64')

In [ ]:
# Checking for min and max alues in the age column

df_new_cust_list['age'].max(), df_new_cust_list['age'].min()

In [ ]:
df_new_cust_list.head()

In [ ]:
df_new_cust_list.info()

In [ ]:
# Checking for duplicated rows

df_new_cust_list[df_new_cust_list.duplicated()]